Table of Contents
 Enum PositionRelatedTo
Namespace
IdeaRS.OpenModel.Parameters
Assembly
IdeaRS.OpenModel.dll
Position, to which is input related to.
public enum PositionRelatedTo
Fields
Axis = 0
Position is related to any axis.
LeftSide = 3
Position is related to the left side of main plate.
Profile = 2
Position is related to the related profile (cross-section) bounding box. In this case is Rows and Cols position are on the positive axes (top, right), RowsNegative and ColsNegative are on the negative axes.
RightSide = 4
Position is related to the right side of main plate.
TopOfSteel = 1
Position is related to top of steel.
Fields
 Name |  Description
 Axis = 0
Position is related to any axis.
 LeftSide = 3
Position is related to the left side of main plate.
 Profile = 2
Position is related to the related profile (cross-section) bounding box. In this case is Rows and Cols position are on the positive axes (top, right), RowsNegative and ColsNegative are on the negative axes.
 RightSide = 4
Position is related to the right side of main plate.
 TopOfSteel = 1
Position is related to top of steel.
 Edit this page